RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r3xx.h
/*******************  Bit definition for DCMIPP_CMSR1 register  ***************/
#define DCMIPP_CMSR1_PRHSYNC_Pos       (0U)
#define DCMIPP_CMSR1_PRHSYNC_Msk       (0x1UL << DCMIPP_CMSR1_PRHSYNC_Pos)     /*!< 0x00000001 */
#define DCMIPP_CMSR1_PRHSYNC           DCMIPP_CMSR1_PRHSYNC_Msk                /*!< state of the HSYNC pin */
#define DCMIPP_CMSR1_PRVSYNC_Pos       (1U)
#define DCMIPP_CMSR1_PRVSYNC_Msk       (0x1UL << DCMIPP_CMSR1_PRVSYNC_Pos)     /*!< 0x00000002 */
#define DCMIPP_CMSR1_PRVSYNC           DCMIPP_CMSR1_PRVSYNC_Msk                /*!< state of the VSYNC pin */
#define DCMIPP_CMSR1_P0CPTACT_Pos      (15U)
#define DCMIPP_CMSR1_P0CPTACT_Msk      (0x1UL << DCMIPP_CMSR1_P0CPTACT_Pos)    /*!< 0x00008000 */
#define DCMIPP_CMSR1_P0CPTACT          DCMIPP_CMSR1_P0CPTACT_Msk               /*!< active frame capture for the Pipe0 */

/*******************  Bit definition for DCMIPP_CMSR2 register  ***************/
#define DCMIPP_CMSR2_ATXERRF_Pos       (5U)
#define DCMIPP_CMSR2_ATXERRF_Msk       (0x1UL << DCMIPP_CMSR2_ATXERRF_Pos)     /*!< 0x00000020 */
#define DCMIPP_CMSR2_ATXERRF           DCMIPP_CMSR2_ATXERRF_Msk                /*!< AXI transfer error interrupt status flag for the IPPLUG */
#define DCMIPP_CMSR2_PRERRF_Pos        (6U)
#define DCMIPP_CMSR2_PRERRF_Msk        (0x1UL << DCMIPP_CMSR2_PRERRF_Pos)      /*!< 0x00000040 */
#define DCMIPP_CMSR2_PRERRF            DCMIPP_CMSR2_PRERRF_Msk                 /*!< Synchronization error raw interrupt status flag for the Parallel Interface */
#define DCMIPP_CMSR2_P0LINEF_Pos       (8U)
#define DCMIPP_CMSR2_P0LINEF_Msk       (0x1UL << DCMIPP_CMSR2_P0LINEF_Pos)      /*!< 0x00000100 */
#define DCMIPP_CMSR2_P0LINEF           DCMIPP_CMSR2_P0LINEF_Msk                /*!< multi-Line Capture completed raw interrupt status flag for the Pipe0 */
#define DCMIPP_CMSR2_P0FRAMEF_Pos      (9U)
#define DCMIPP_CMSR2_P0FRAMEF_Msk      (0x1UL << DCMIPP_CMSR2_P0FRAMEF_Pos)    /*!< 0x00000200 */
#define DCMIPP_CMSR2_P0FRAMEF          DCMIPP_CMSR2_P0FRAMEF_Msk               /*!< Frame Capture completed raw interrupt status flag for the Pipe0 */
#define DCMIPP_CMSR2_P0VSYNCF_Pos      (10U)
#define DCMIPP_CMSR2_P0VSYNCF_Msk      (0x1UL << DCMIPP_CMSR2_P0VSYNCF_Pos)    /*!< 0x00000400 */
#define DCMIPP_CMSR2_P0VSYNCF          DCMIPP_CMSR2_P0VSYNCF_Msk               /*!< VSYNC raw interrupt status flag for the Pipe0 */
#define DCMIPP_CMSR2_P0LIMITF_Pos      (14U)
#define DCMIPP_CMSR2_P0LIMITF_Msk      (0x1UL << DCMIPP_CMSR2_P0LIMITF_Pos)    /*!< 0x00004000 */
#define DCMIPP_CMSR2_P0LIMITF          DCMIPP_CMSR2_P0LIMITF_Msk               /*!< Limit raw interrupt status flag for the Pipe0 */
#define DCMIPP_CMSR2_P0OVRF_Pos        (15U)
#define DCMIPP_CMSR2_P0OVRF_Msk        (0x1UL << DCMIPP_CMSR2_P0OVRF_Pos)      /*!< 0x00008000 */
#define DCMIPP_CMSR2_P0OVRF            DCMIPP_CMSR2_P0OVRF_Msk                 /*!< Overrun raw interrupt status flag for the Pipe0 */

/*******************  Bit definition for DCMIPP_CMFCR register  ***************/
#define DCMIPP_CMFCR_CATXERRF_Pos      (5U)
#define DCMIPP_CMFCR_CATXERRF_Msk      (0x1UL << DCMIPP_CMFCR_CATXERRF_Pos)    /*!< 0x00000020 */
#define DCMIPP_CMFCR_CATXERRF          DCMIPP_CMFCR_CATXERRF_Msk               /*!< AXI transfer error interrupt status clear for the IPPLUG */
#define DCMIPP_CMFCR_CPRERRF_Pos       (6U)
#define DCMIPP_CMFCR_CPRERRF_Msk       (0x1UL << DCMIPP_CMFCR_CPRERRF_Pos)     /*!< 0x00000040 */
#define DCMIPP_CMFCR_CPRERRF           DCMIPP_CMFCR_CPRERRF_Msk                /*!< Synchronization error raw interrupt status clear for the Parallel Interface */
#define DCMIPP_CMFCR_CP0LINEF_Pos      (8U)
#define DCMIPP_CMFCR_CP0LINEF_Msk      (0x1UL << DCMIPP_CMFCR_CP0LINEF_Pos)    /*!< 0x00000100 */
#define DCMIPP_CMFCR_CP0LINEF          DCMIPP_CMFCR_CP0LINEF_Msk               /*!< multi-Line Capture completed raw interrupt status clear for the Pipe0 */
#define DCMIPP_CMFCR_CP0FRAMEF_Pos     (9U)
#define DCMIPP_CMFCR_CP0FRAMEF_Msk     (0x1UL << DCMIPP_CMFCR_CP0FRAMEF_Pos)   /*!< 0x00000200 */
#define DCMIPP_CMFCR_CP0FRAMEF         DCMIPP_CMFCR_CP0FRAMEF_Msk              /*!< Frame Capture completed raw interrupt status clear for the Pipe0 */
#define DCMIPP_CMFCR_CP0VSYNCF_Pos     (10U)
#define DCMIPP_CMFCR_CP0VSYNCF_Msk     (0x1UL << DCMIPP_CMFCR_CP0VSYNCF_Pos)   /*!< 0x00000400 */
#define DCMIPP_CMFCR_CP0VSYNCF         DCMIPP_CMFCR_CP0VSYNCF_Msk              /*!< VSYNC raw interrupt status clear for the Pipe0 */
#define DCMIPP_CMFCR_CP0LIMITF_Pos     (14U)
#define DCMIPP_CMFCR_CP0LIMITF_Msk     (0x1UL << DCMIPP_CMFCR_CP0LIMITF_Pos)   /*!< 0x00004000 */
#define DCMIPP_CMFCR_CP0LIMITF         DCMIPP_CMFCR_CP0LIMITF_Msk              /*!< Limit raw interrupt status clear for the Pipe0 */
#define DCMIPP_CMFCR_CP0OVRF_Pos       (15U)
#define DCMIPP_CMFCR_CP0OVRF_Msk       (0x1UL << DCMIPP_CMFCR_CP0OVRF_Pos)     /*!< 0x00008000 */
#define DCMIPP_CMFCR_CP0OVRF           DCMIPP_CMFCR_CP0OVRF_Msk                /*!< Overrun raw interrupt status clear for the Pipe0 */

/*******************  Bit definition for DCMIPP_P0FSCR register  **************/
#define DCMIPP_P0FSCR_PIPEN_Pos        (31U)
#define DCMIPP_P0FSCR_PIPEN_Msk        (0x1UL << DCMIPP_P0FSCR_PIPEN_Pos)      /*!< 0x80000000 */
#define DCMIPP_P0FSCR_PIPEN            DCMIPP_P0FSCR_PIPEN_Msk                 /*!< activation of this Pipe */

/*******************  Bit definition for DCMIPP_P0FCTCR register  *************/
#define DCMIPP_P0FCTCR_FRATE_Pos       (0U)
#define DCMIPP_P0FCTCR_FRATE_Msk       (0x3UL << DCMIPP_P0FCTCR_FRATE_Pos)     /*!< 0x00000003 */
#define DCMIPP_P0FCTCR_FRATE           DCMIPP_P0FCTCR_FRATE_Msk                /*!< FRATE[1:0]: Frame capture rate control */
#define DCMIPP_P0FCTCR_CPTMODE_Pos     (2U)
#define DCMIPP_P0FCTCR_CPTMODE_Msk     (0x1UL << DCMIPP_P0FCTCR_CPTMODE_Pos)   /*!< 0x00000004 */
#define DCMIPP_P0FCTCR_CPTMODE         DCMIPP_P0FCTCR_CPTMODE_Msk              /*!< Capture mode */
#define DCMIPP_P0FCTCR_CPTREQ_Pos      (3U)
#define DCMIPP_P0FCTCR_CPTREQ_Msk      (0x1UL << DCMIPP_P0FCTCR_CPTREQ_Pos)    /*!< 0x00000008 */
#define DCMIPP_P0FCTCR_CPTREQ          DCMIPP_P0FCTCR_CPTREQ_Msk               /*!< Capture requested */

/*******************  Bit definition for DCMIPP_P0SCSTR register  *************/
#define DCMIPP_P0SCSTR_HSTART_Pos      (0U)
#define DCMIPP_P0SCSTR_HSTART_Msk      (0xFFFUL << DCMIPP_P0SCSTR_HSTART_Pos)  /*!< 0x00000FFF */
#define DCMIPP_P0SCSTR_HSTART          DCMIPP_P0SCSTR_HSTART_Msk               /*!< HSTART[11:0]: horizontal start */
#define DCMIPP_P0SCSTR_VSTART_Pos      (16U)
#define DCMIPP_P0SCSTR_VSTART_Msk      (0xFFFUL << DCMIPP_P0SCSTR_VSTART_Pos)  /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSTR_VSTART          DCMIPP_P0SCSTR_VSTART_Msk               /*!< VSTART[11:0]: vertical start */

/*******************  Bit definition for DCMIPP_P0SCSZR register  *************/
#define DCMIPP_P0SCSZR_HSIZE_Pos       (0U)
#define DCMIPP_P0SCSZR_HSIZE_Msk       (0xFFFUL << DCMIPP_P0SCSZR_HSIZE_Pos)   /*!< 0x00000FFF */
#define DCMIPP_P0SCSZR_HSIZE           DCMIPP_P0SCSZR_HSIZE_Msk                /*!< HSTART[11:0]: horizontal size */
#define DCMIPP_P0SCSZR_VSIZE_Pos       (16U)
#define DCMIPP_P0SCSZR_VSIZE_Msk       (0xFFFUL << DCMIPP_P0SCSZR_VSIZE_Pos)   /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSZR_VSIZE           DCMIPP_P0SCSZR_VSIZE_Msk                /*!< VSTART[11:0]: vertical size */
#define DCMIPP_P0SCSZR_POSNEG_Pos      (30U)
#define DCMIPP_P0SCSZR_POSNEG_Msk      (0x1UL << DCMIPP_P0SCSZR_POSNEG_Pos)    /*!< 0x40000000 */
#define DCMIPP_P0SCSZR_POSNEG          DCMIPP_P0SCSZR_POSNEG_Msk               /*!< Negative area */
#define DCMIPP_P0SCSZR_ENABLE_Pos      (31U)
#define DCMIPP_P0SCSZR_ENABLE_Msk      (0x1UL << DCMIPP_P0SCSZR_ENABLE_Pos)    /*!< 0x80000000 */
#define DCMIPP_P0SCSZR_ENABLE          DCMIPP_P0SCSZR_ENABLE_Msk               /*!< Enable */

/*******************  Bit definition for DCMIPP_P0DCCNTR register  ************/
#define DCMIPP_P0DCCNTR_CNT_Pos        (0U)
#define DCMIPP_P0DCCNTR_CNT_Msk        (0x3FFFFFFUL << DCMIPP_P0DCCNTR_CNT_Pos) /*!< 0x03FFFFFF */
#define DCMIPP_P0DCCNTR_CNT            DCMIPP_P0DCCNTR_CNT_Msk                  /*!< CNT[25:0]: number of data dumped during the frame */

/*******************  Bit definition for DCMIPP_P0DCLMTR register  ************/
#define DCMIPP_P0DCLMTR_LIMIT_Pos      (0U)
#define DCMIPP_P0DCLMTR_LIMIT_Msk      (0xFFFFFFUL << DCMIPP_P0DCLMTR_LIMIT_Pos) /*!< 0x00FFFFFF */
#define DCMIPP_P0DCLMTR_LIMIT          DCMIPP_P0DCLMTR_LIMIT_Msk                 /*!< LIMIT[23:0]: maximum number of data dumped during the frame */
#define DCMIPP_P0DCLMTR_ENABLE_Pos     (31U)
#define DCMIPP_P0DCLMTR_ENABLE_Msk     (0x1UL << DCMIPP_P0DCLMTR_ENABLE_Pos)   /*!< 0x80000000 */
#define DCMIPP_P0DCLMTR_ENABLE         DCMIPP_P0DCLMTR_ENABLE_Msk              /*!< Enable */

/*******************  Bit definition for DCMIPP_P0PPCR register  **************/
#define DCMIPP_P0PPCR_PAD_Pos          (5U)
#define DCMIPP_P0PPCR_PAD_Msk          (0x1UL << DCMIPP_P0PPCR_PAD_Pos)        /*!< 0x00000020 */
#define DCMIPP_P0PPCR_PAD              DCMIPP_P0PPCR_PAD_Msk                   /*!< PAD mode */
#define DCMIPP_P0PPCR_BSM_Pos          (7U)
#define DCMIPP_P0PPCR_BSM_Msk          (0x3UL << DCMIPP_P0PPCR_BSM_Pos)        /*!< 0x00000180 */
#define DCMIPP_P0PPCR_BSM              DCMIPP_P0PPCR_BSM_Msk                   /*!< Byte Select mode */
#define DCMIPP_P0PPCR_OEBS_Pos         (9U)
#define DCMIPP_P0PPCR_OEBS_Msk         (0x1UL << DCMIPP_P0PPCR_OEBS_Pos)       /*!< 0x00000200 */
#define DCMIPP_P0PPCR_OEBS             DCMIPP_P0PPCR_OEBS_Msk                  /*!< Odd/Even Byte Select */
#define DCMIPP_P0PPCR_LSM_Pos          (10U)
#define DCMIPP_P0PPCR_LSM_Msk          (0x1UL << DCMIPP_P0PPCR_LSM_Pos)        /*!< 0x00000400 */
#define DCMIPP_P0PPCR_LSM              DCMIPP_P0PPCR_LSM_Msk                   /*!< Line Select mode */
#define DCMIPP_P0PPCR_OELS_Pos         (11U)
#define DCMIPP_P0PPCR_OELS_Msk         (0x1UL << DCMIPP_P0PPCR_OELS_Pos)       /*!< 0x00000800 */
#define DCMIPP_P0PPCR_OELS             DCMIPP_P0PPCR_OELS_Msk                  /*!< Odd/Even Line Select */
#define DCMIPP_P0PPCR_LINEMULT_Pos     (13U)
#define DCMIPP_P0PPCR_LINEMULT_Msk     (0x7UL << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< 0x0000E000 */
#define DCMIPP_P0PPCR_LINEMULT         DCMIPP_P0PPCR_LINEMULT_Msk              /*!< LINEMULT[2:0] */
#define DCMIPP_P0PPCR_DBM_Pos          (16U)
#define DCMIPP_P0PPCR_DBM_Msk          (0x1UL << DCMIPP_P0PPCR_DBM_Pos)        /*!< 0x00010000 */
#define DCMIPP_P0PPCR_DBM              DCMIPP_P0PPCR_DBM_Msk                   /*!< Double buffer mode */

