RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r3xx.h
  /*!<FDCAN config registers */
/*****************  Bit definition for FDCAN_CKDIV register  ******************/
#define FDCAN_CKDIV_PDIV_Pos         (0U)
#define FDCAN_CKDIV_PDIV_Msk         (0xFUL << FDCAN_CKDIV_PDIV_Pos)           /*!< 0x0000000F */
#define FDCAN_CKDIV_PDIV             FDCAN_CKDIV_PDIV_Msk                      /*!<Input Clock Divider                      */


/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
#define FLASH_LATENCY_DEFAULT                (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0) /* default flash latency 3WS ) */

/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY_Pos                (0U)
#define FLASH_ACR_LATENCY_Msk                (0xFUL << FLASH_ACR_LATENCY_Pos)                    /*!< 0x0000000F */
#define FLASH_ACR_LATENCY                    FLASH_ACR_LATENCY_Msk                               /*!< Read Latency */
#define FLASH_ACR_LATENCY_0                  (0x1UL << FLASH_ACR_LATENCY_Pos)                    /*!< 0x00000001 */
#define FLASH_ACR_LATENCY_1                  (0x2UL << FLASH_ACR_LATENCY_Pos)                    /*!< 0x00000002 */
#define FLASH_ACR_LATENCY_2                  (0x4UL << FLASH_ACR_LATENCY_Pos)                    /*!< 0x00000004 */
#define FLASH_ACR_LATENCY_3                  (0x8UL << FLASH_ACR_LATENCY_Pos)                    /*!< 0x00000008 */
#define FLASH_ACR_WRHIGHFREQ_Pos             (4U)
#define FLASH_ACR_WRHIGHFREQ_Msk             (0x3UL << FLASH_ACR_WRHIGHFREQ_Pos)                 /*!< 0x00000030 */
#define FLASH_ACR_WRHIGHFREQ                 FLASH_ACR_WRHIGHFREQ_Msk                            /*!< Flash signal delay */
#define FLASH_ACR_WRHIGHFREQ_0               (0x1UL << FLASH_ACR_WRHIGHFREQ_Pos)                 /*!< 0x00000010 */
#define FLASH_ACR_WRHIGHFREQ_1               (0x2UL << FLASH_ACR_WRHIGHFREQ_Pos)                 /*!< 0x00000020 */

/******************  Bits definition for FLASH_KEYR register  *****************/
#define FLASH_KEYR_CUKEY_Pos                 (0U)
#define FLASH_KEYR_CUKEY_Msk                 (0xFFFFFFFFUL << FLASH_KEYR_CUKEY_Pos)              /*!< 0xFFFFFFFF */
#define FLASH_KEYR_CUKEY                     FLASH_KEYR_CUKEY_Msk                                /*!< Control unlock key */

/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_LOCK_Pos                    (0U)
#define FLASH_CR_LOCK_Msk                    (0x1UL << FLASH_CR_LOCK_Pos)                        /*!< 0x00000001 */
#define FLASH_CR_LOCK                        FLASH_CR_LOCK_Msk                                   /*!< Configuration lock bit */
#define FLASH_CR_PG_Pos                      (1U)
#define FLASH_CR_PG_Msk                      (0x1UL << FLASH_CR_PG_Pos)                          /*!< 0x00000002 */
#define FLASH_CR_PG                          FLASH_CR_PG_Msk                                     /*!< Internal buffer control bit */
#define FLASH_CR_SER_Pos                     (2U)
#define FLASH_CR_SER_Msk                     (0x1UL << FLASH_CR_SER_Pos)                         /*!< 0x00000004 */
#define FLASH_CR_SER                         FLASH_CR_SER_Msk                                    /*!< Sector erase request */
#define FLASH_CR_BER_Pos                     (3U)
#define FLASH_CR_BER_Msk                     (0x1UL << FLASH_CR_BER_Pos)                         /*!< 0x00000008 */
#define FLASH_CR_BER                         FLASH_CR_BER_Msk                                    /*!< Bank erase request */
#define FLASH_CR_FW_Pos                      (4U)
#define FLASH_CR_FW_Msk                      (0x1UL << FLASH_CR_FW_Pos)                          /*!< 0x00000010 */
#define FLASH_CR_FW                          FLASH_CR_FW_Msk                                     /*!< Force write */
#define FLASH_CR_START_Pos                   (5U)
#define FLASH_CR_START_Msk                   (0x1UL << FLASH_CR_START_Pos)                       /*!< 0x00000020 */
#define FLASH_CR_START                       FLASH_CR_START_Msk                                  /*!< Erase start control bit */
#define FLASH_CR_SSN_Pos                     (6U)
#define FLASH_CR_SSN_Msk                     (0x7UL << FLASH_CR_SSN_Pos)                         /*!< 0x000001C0 */
#define FLASH_CR_SSN                         FLASH_CR_SSN_Msk                                    /*!< Sector erase selection number */
#define FLASH_CR_SSN_0                       (0x1UL << FLASH_CR_SSN_Pos)                         /*!< 0x00000040 */
#define FLASH_CR_SSN_1                       (0x2UL << FLASH_CR_SSN_Pos)                         /*!< 0x00000080 */
#define FLASH_CR_SSN_2                       (0x4UL << FLASH_CR_SSN_Pos)                         /*!< 0x00000100 */
#define FLASH_CR_PG_OTP_Pos                  (16U)
#define FLASH_CR_PG_OTP_Msk                  (0x1UL << FLASH_CR_PG_OTP_Pos)                      /*!< 0x00010000 */
#define FLASH_CR_PG_OTP                      FLASH_CR_PG_OTP_Msk                                 /*!< Program Enable for OTP Area */
#define FLASH_CR_CRC_EN_Pos                  (17U)
#define FLASH_CR_CRC_EN_Msk                  (0x1UL << FLASH_CR_CRC_EN_Pos)                      /*!< 0x00020000 */
#define FLASH_CR_CRC_EN                      FLASH_CR_CRC_EN_Msk                                 /*!< CRC enable */
#define FLASH_CR_ALL_BANKS_Pos               (24U)
#define FLASH_CR_ALL_BANKS_Msk               (0x1UL << FLASH_CR_ALL_BANKS_Pos)                   /*!< 0x01000000 */
#define FLASH_CR_ALL_BANKS                   FLASH_CR_ALL_BANKS_Msk                              /*!< All banks select bit */

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_BUSY_Pos                    (0U)
#define FLASH_SR_BUSY_Msk                    (0x1UL << FLASH_SR_BUSY_Pos)                        /*!< 0x00000001 */
#define FLASH_SR_BUSY                        FLASH_SR_BUSY_Msk                                   /*!< Busy flag */
#define FLASH_SR_WBNE_Pos                    (1U)
#define FLASH_SR_WBNE_Msk                    (0x1UL << FLASH_SR_WBNE_Pos)                        /*!< 0x00000002 */
#define FLASH_SR_WBNE                        FLASH_SR_WBNE_Msk                                   /*!< Write buffer not empty flag */
#define FLASH_SR_QW_Pos                      (2U)
#define FLASH_SR_QW_Msk                      (0x1UL << FLASH_SR_QW_Pos)                          /*!< 0x00000004 */
#define FLASH_SR_QW                          FLASH_SR_QW_Msk                                     /*!< Wait queue flag */
#define FLASH_SR_CRC_BUSY_Pos                (3U)
#define FLASH_SR_CRC_BUSY_Msk                (0x1UL << FLASH_SR_CRC_BUSY_Pos)                    /*!< 0x00000008 */
#define FLASH_SR_CRC_BUSY                    FLASH_SR_CRC_BUSY_Msk                               /*!< CRC busy flag */
#define FLASH_SR_IS_PROGRAM_Pos              (4U)
#define FLASH_SR_IS_PROGRAM_Msk              (0x1UL << FLASH_SR_IS_PROGRAM_Pos)                  /*!< 0x00000010 */
#define FLASH_SR_IS_PROGRAM                  FLASH_SR_IS_PROGRAM_Msk                             /*!< Is program */
#define FLASH_SR_IS_ERASE_Pos                (5U)
#define FLASH_SR_IS_ERASE_Msk                (0x1UL << FLASH_SR_IS_ERASE_Pos)                    /*!< 0x00000020 */
#define FLASH_SR_IS_ERASE                    FLASH_SR_IS_ERASE_Msk                               /*!< Is an erase */
#define FLASH_SR_IS_OPTCHANGE_Pos            (6U)
#define FLASH_SR_IS_OPTCHANGE_Msk            (0x1UL << FLASH_SR_IS_OPTCHANGE_Pos)                /*!< 0x00000040 */
#define FLASH_SR_IS_OPTCHANGE                FLASH_SR_IS_OPTCHANGE_Msk                           /*!< Is an option change */

/******************  Bits definition for FLASH_IER register  ******************/
#define FLASH_IER_EOPIE_Pos                  (16U)
#define FLASH_IER_EOPIE_Msk                  (0x1UL << FLASH_IER_EOPIE_Pos)                      /*!< 0x00010000 */
#define FLASH_IER_EOPIE                      FLASH_IER_EOPIE_Msk                                 /*!< End of program interrupt enable bit */
#define FLASH_IER_WRPERRIE_Pos               (17U)
#define FLASH_IER_WRPERRIE_Msk               (0x1UL << FLASH_IER_WRPERRIE_Pos)                   /*!< 0x00020000 */
#define FLASH_IER_WRPERRIE                   FLASH_IER_WRPERRIE_Msk                              /*!< Write protection error interrupt enable bit */
#define FLASH_IER_PGSERRIE_Pos               (18U)
#define FLASH_IER_PGSERRIE_Msk               (0x1UL << FLASH_IER_PGSERRIE_Pos)                   /*!< 0x00040000 */
#define FLASH_IER_PGSERRIE                   FLASH_IER_PGSERRIE_Msk                              /*!< Programming sequence error interrupt enable bit */
#define FLASH_IER_STRBERRIE_Pos              (19U)
#define FLASH_IER_STRBERRIE_Msk              (0x1UL << FLASH_IER_STRBERRIE_Pos)                  /*!< 0x00080000 */
#define FLASH_IER_STRBERRIE                  FLASH_IER_STRBERRIE_Msk                             /*!< Strobe error interrupt enable bit */
#define FLASH_IER_OBLERRIE_Pos               (20U)
#define FLASH_IER_OBLERRIE_Msk               (0x1UL << FLASH_IER_OBLERRIE_Pos)                   /*!< 0x00100000 */
#define FLASH_IER_OBLERRIE                   FLASH_IER_OBLERRIE_Msk                              /*!< Option byte loading error interrupt enable bit */
#define FLASH_IER_INCERRIE_Pos               (21U)
#define FLASH_IER_INCERRIE_Msk               (0x1UL << FLASH_IER_INCERRIE_Pos)                   /*!< 0x00200000 */
#define FLASH_IER_INCERRIE                   FLASH_IER_INCERRIE_Msk                              /*!< Inconsistency error interrupt enable bit */
#define FLASH_IER_RDSERRIE_Pos               (24U)
#define FLASH_IER_RDSERRIE_Msk               (0x1UL << FLASH_IER_RDSERRIE_Pos)                   /*!< 0x01000000 */
#define FLASH_IER_RDSERRIE                   FLASH_IER_RDSERRIE_Msk                              /*!< Read security error interrupt enable bit */
#define FLASH_IER_SNECCERRIE_Pos             (25U)
#define FLASH_IER_SNECCERRIE_Msk             (0x1UL << FLASH_IER_SNECCERRIE_Pos)                 /*!< 0x02000000 */
#define FLASH_IER_SNECCERRIE                 FLASH_IER_SNECCERRIE_Msk                            /*!< ECC single correction error interrupt enable bit */
#define FLASH_IER_DBECCERRIE_Pos             (26U)
#define FLASH_IER_DBECCERRIE_Msk             (0x1UL << FLASH_IER_DBECCERRIE_Pos)                 /*!< 0x04000000 */
#define FLASH_IER_DBECCERRIE                 FLASH_IER_DBECCERRIE_Msk                            /*!< ECC double detection error interrupt enable bit */
#define FLASH_IER_CRCENDIE_Pos               (27U)
#define FLASH_IER_CRCENDIE_Msk               (0x1UL << FLASH_IER_CRCENDIE_Pos)                   /*!< 0x08000000 */
#define FLASH_IER_CRCENDIE                   FLASH_IER_CRCENDIE_Msk                              /*!< CRC end of calculation interrupt enable bit */
#define FLASH_IER_CRCRDERRIE_Pos             (28U)
#define FLASH_IER_CRCRDERRIE_Msk             (0x1UL << FLASH_IER_CRCRDERRIE_Pos)                 /*!< 0x10000000 */
#define FLASH_IER_CRCRDERRIE                 FLASH_IER_CRCRDERRIE_Msk                            /*!< CRC read error interrupt enable bit */

