RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r3xx.h
/********************  Bit definition for RCC_APB4ENR register  ***************/
#define RCC_APB4ENR_SBSEN_Pos          (1U)
#define RCC_APB4ENR_SBSEN_Msk          (0x1UL << RCC_APB4ENR_SBSEN_Pos)        /*!< 0x00000002 */
#define RCC_APB4ENR_SBSEN              RCC_APB4ENR_SBSEN_Msk
#define RCC_APB4ENR_LPUART1EN_Pos      (3U)
#define RCC_APB4ENR_LPUART1EN_Msk      (0x1UL << RCC_APB4ENR_LPUART1EN_Pos)    /*!< 0x00000008 */
#define RCC_APB4ENR_LPUART1EN          RCC_APB4ENR_LPUART1EN_Msk
#define RCC_APB4ENR_SPI6EN_Pos         (5U)
#define RCC_APB4ENR_SPI6EN_Msk         (0x1UL << RCC_APB4ENR_SPI6EN_Pos)       /*!< 0x00000020 */
#define RCC_APB4ENR_SPI6EN             RCC_APB4ENR_SPI6EN_Msk
#define RCC_APB4ENR_LPTIM2EN_Pos       (9U)
#define RCC_APB4ENR_LPTIM2EN_Msk       (0x1UL << RCC_APB4ENR_LPTIM2EN_Pos)     /*!< 0x00000200 */
#define RCC_APB4ENR_LPTIM2EN           RCC_APB4ENR_LPTIM2EN_Msk
#define RCC_APB4ENR_LPTIM3EN_Pos       (10U)
#define RCC_APB4ENR_LPTIM3EN_Msk       (0x1UL << RCC_APB4ENR_LPTIM3EN_Pos)     /*!< 0x00000400 */
#define RCC_APB4ENR_LPTIM3EN           RCC_APB4ENR_LPTIM3EN_Msk
#define RCC_APB4ENR_LPTIM4EN_Pos       (11U)
#define RCC_APB4ENR_LPTIM4EN_Msk       (0x1UL << RCC_APB4ENR_LPTIM4EN_Pos)     /*!< 0x00000800 */
#define RCC_APB4ENR_LPTIM4EN           RCC_APB4ENR_LPTIM4EN_Msk
#define RCC_APB4ENR_LPTIM5EN_Pos       (12U)
#define RCC_APB4ENR_LPTIM5EN_Msk       (0x1UL << RCC_APB4ENR_LPTIM5EN_Pos)     /*!< 0x00001000 */
#define RCC_APB4ENR_LPTIM5EN           RCC_APB4ENR_LPTIM5EN_Msk
#define RCC_APB4ENR_VREFEN_Pos         (15U)
#define RCC_APB4ENR_VREFEN_Msk         (0x1UL << RCC_APB4ENR_VREFEN_Pos)       /*!< 0x00008000 */
#define RCC_APB4ENR_VREFEN             RCC_APB4ENR_VREFEN_Msk
#define RCC_APB4ENR_RTCAPBEN_Pos       (16U)
#define RCC_APB4ENR_RTCAPBEN_Msk       (0x1UL << RCC_APB4ENR_RTCAPBEN_Pos)     /*!< 0x00010000 */
#define RCC_APB4ENR_RTCAPBEN           RCC_APB4ENR_RTCAPBEN_Msk
#define RCC_APB4ENR_DTSEN_Pos          (26U)
#define RCC_APB4ENR_DTSEN_Msk          (0x1UL << RCC_APB4ENR_DTSEN_Pos)        /*!< 0x04000000 */
#define RCC_APB4ENR_DTSEN              RCC_APB4ENR_DTSEN_Msk

/********************  Bit definition for RCC_APB5ENR register  ***************/
#define RCC_APB5ENR_DCMIPPEN_Pos       (2U)
#define RCC_APB5ENR_DCMIPPEN_Msk       (0x1UL << RCC_APB5ENR_DCMIPPEN_Pos)     /*!< 0x00000004 */
#define RCC_APB5ENR_DCMIPPEN           RCC_APB5ENR_DCMIPPEN_Msk
#define RCC_APB5ENR_GFXTIMEN_Pos       (4U)
#define RCC_APB5ENR_GFXTIMEN_Msk       (0x1UL << RCC_APB5ENR_GFXTIMEN_Pos)     /*!< 0x00000010 */
#define RCC_APB5ENR_GFXTIMEN           RCC_APB5ENR_GFXTIMEN_Msk

/********************  Bit definition for RCC_AHB1LPENR register  *************/
#define RCC_AHB1LPENR_GPDMA1LPEN_Pos   (4U)
#define RCC_AHB1LPENR_GPDMA1LPEN_Msk   (0x1UL << RCC_AHB1LPENR_GPDMA1LPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB1LPENR_GPDMA1LPEN       RCC_AHB1LPENR_GPDMA1LPEN_Msk
#define RCC_AHB1LPENR_ADC12LPEN_Pos    (5U)
#define RCC_AHB1LPENR_ADC12LPEN_Msk    (0x1UL << RCC_AHB1LPENR_ADC12LPEN_Pos)  /*!< 0x00000020 */
#define RCC_AHB1LPENR_ADC12LPEN        RCC_AHB1LPENR_ADC12LPEN_Msk
#define RCC_AHB1LPENR_ETH1MACLPEN_Pos  (15U)
#define RCC_AHB1LPENR_ETH1MACLPEN_Msk  (0x1UL << RCC_AHB1LPENR_ETH1MACLPEN_Pos) /*!< 0x00008000 */
#define RCC_AHB1LPENR_ETH1MACLPEN      RCC_AHB1LPENR_ETH1MACLPEN_Msk
#define RCC_AHB1LPENR_ETH1TXLPEN_Pos   (16U)
#define RCC_AHB1LPENR_ETH1TXLPEN_Msk   (0x1UL << RCC_AHB1LPENR_ETH1TXLPEN_Pos) /*!< 0x00010000 */
#define RCC_AHB1LPENR_ETH1TXLPEN       RCC_AHB1LPENR_ETH1TXLPEN_Msk
#define RCC_AHB1LPENR_ETH1RXLPEN_Pos   (17U)
#define RCC_AHB1LPENR_ETH1RXLPEN_Msk   (0x1UL << RCC_AHB1LPENR_ETH1RXLPEN_Pos) /*!< 0x00020000 */
#define RCC_AHB1LPENR_ETH1RXLPEN       RCC_AHB1LPENR_ETH1RXLPEN_Msk
#define RCC_AHB1LPENR_UCPDCTRL_Pos     (24U)
#define RCC_AHB1LPENR_UCPDCTRL_Msk     (0x1UL << RCC_AHB1LPENR_UCPDCTRL_Pos)  /*!< 0x01000000 */
#define RCC_AHB1LPENR_UCPDCTRL         RCC_AHB1LPENR_UCPDCTRL_Msk
#define RCC_AHB1LPENR_OTGHSLPEN_Pos    (25U)
#define RCC_AHB1LPENR_OTGHSLPEN_Msk    (0x1UL << RCC_AHB1LPENR_OTGHSLPEN_Pos)  /*!< 0x02000000 */
#define RCC_AHB1LPENR_OTGHSLPEN        RCC_AHB1LPENR_OTGHSLPEN_Msk
#define RCC_AHB1LPENR_USBPHYCLPEN_Pos  (26U)
#define RCC_AHB1LPENR_USBPHYCLPEN_Msk  (0x1UL << RCC_AHB1LPENR_USBPHYCLPEN_Pos)/*!< 0x04000000 */
#define RCC_AHB1LPENR_USBPHYCLPEN      RCC_AHB1LPENR_USBPHYCLPEN_Msk
#define RCC_AHB1LPENR_OTGFSLPEN_Pos    (27U)
#define RCC_AHB1LPENR_OTGFSLPEN_Msk    (0x1UL << RCC_AHB1LPENR_OTGFSLPEN_Pos)  /*!< 0x08000000 */
#define RCC_AHB1LPENR_OTGFSLPEN        RCC_AHB1LPENR_OTGFSLPEN_Msk
#define RCC_AHB1LPENR_ADF1LPEN_Pos     (31U)
#define RCC_AHB1LPENR_ADF1LPEN_Msk     (0x1UL << RCC_AHB1LPENR_ADF1LPEN_Pos)   /*!< 0x80000000 */
#define RCC_AHB1LPENR_ADF1LPEN         RCC_AHB1LPENR_ADF1LPEN_Msk

/********************  Bit definition for RCC_AHB2LPENR register  *************/
#define RCC_AHB2LPENR_PSSILPEN_Pos     (1U)
#define RCC_AHB2LPENR_PSSILPEN_Msk     (0x1UL << RCC_AHB2LPENR_PSSILPEN_Pos)   /*!< 0x00000002 */
#define RCC_AHB2LPENR_PSSILPEN         RCC_AHB2LPENR_PSSILPEN_Msk
#define RCC_AHB2LPENR_SDMMC2LPEN_Pos   (9U)
#define RCC_AHB2LPENR_SDMMC2LPEN_Msk   (0x1UL << RCC_AHB2LPENR_SDMMC2LPEN_Pos) /*!< 0x00000200 */
#define RCC_AHB2LPENR_SDMMC2LPEN       RCC_AHB2LPENR_SDMMC2LPEN_Msk
#define RCC_AHB2LPENR_CORDICLPEN_Pos   (14U)
#define RCC_AHB2LPENR_CORDICLPEN_Msk   (0x1UL << RCC_AHB2LPENR_CORDICLPEN_Pos) /*!< 0x00004000 */
#define RCC_AHB2LPENR_CORDICLPEN       RCC_AHB2LPENR_CORDICLPEN_Msk
#define RCC_AHB2LPENR_SRAM1LPEN_Pos    (29U)
#define RCC_AHB2LPENR_SRAM1LPEN_Msk    (0x1UL << RCC_AHB2LPENR_SRAM1LPEN_Pos)  /*!< 0x20000000 */
#define RCC_AHB2LPENR_SRAM1LPEN        RCC_AHB2LPENR_SRAM1LPEN_Msk
#define RCC_AHB2LPENR_SRAM2LPEN_Pos    (30U)
#define RCC_AHB2LPENR_SRAM2LPEN_Msk    (0x1UL << RCC_AHB2LPENR_SRAM2LPEN_Pos)  /*!< 0x40000000 */
#define RCC_AHB2LPENR_SRAM2LPEN        RCC_AHB2LPENR_SRAM2LPEN_Msk

/********************  Bit definition for RCC_AHB3LPENR register  *************/
#define RCC_AHB3LPENR_RNGLPEN_Pos      (0U)
#define RCC_AHB3LPENR_RNGLPEN_Msk      (0x1UL << RCC_AHB3LPENR_RNGLPEN_Pos)    /*!< 0x00000001 */
#define RCC_AHB3LPENR_RNGLPEN          RCC_AHB3LPENR_RNGLPEN_Msk
#define RCC_AHB3LPENR_HASHLPEN_Pos     (1U)
#define RCC_AHB3LPENR_HASHLPEN_Msk     (0x1UL << RCC_AHB3LPENR_HASHLPEN_Pos)   /*!< 0x00000002 */
#define RCC_AHB3LPENR_HASHLPEN         RCC_AHB3LPENR_HASHLPEN_Msk
#define RCC_AHB3LPENR_PKALPEN_Pos      (6U)
#define RCC_AHB3LPENR_PKALPEN_Msk      (0x1UL << RCC_AHB3LPENR_PKALPEN_Pos)    /*!< 0x00000040 */
#define RCC_AHB3LPENR_PKALPEN          RCC_AHB3LPENR_PKALPEN_Msk

/********************  Bit definition for RCC_AHB4LPENR register  *************/
#define RCC_AHB4LPENR_GPIOALPEN_Pos    (0U)
#define RCC_AHB4LPENR_GPIOALPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOALPEN_Pos)  /*!< 0x00000001 */
#define RCC_AHB4LPENR_GPIOALPEN        RCC_AHB4LPENR_GPIOALPEN_Msk
#define RCC_AHB4LPENR_GPIOBLPEN_Pos    (1U)
#define RCC_AHB4LPENR_GPIOBLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOBLPEN_Pos)  /*!< 0x00000002 */
#define RCC_AHB4LPENR_GPIOBLPEN        RCC_AHB4LPENR_GPIOBLPEN_Msk
#define RCC_AHB4LPENR_GPIOCLPEN_Pos    (2U)
#define RCC_AHB4LPENR_GPIOCLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOCLPEN_Pos)  /*!< 0x00000004 */
#define RCC_AHB4LPENR_GPIOCLPEN        RCC_AHB4LPENR_GPIOCLPEN_Msk
#define RCC_AHB4LPENR_GPIODLPEN_Pos    (3U)
#define RCC_AHB4LPENR_GPIODLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIODLPEN_Pos)  /*!< 0x00000008 */
#define RCC_AHB4LPENR_GPIODLPEN        RCC_AHB4LPENR_GPIODLPEN_Msk
#define RCC_AHB4LPENR_GPIOELPEN_Pos    (4U)
#define RCC_AHB4LPENR_GPIOELPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOELPEN_Pos)  /*!< 0x00000010 */
#define RCC_AHB4LPENR_GPIOELPEN        RCC_AHB4LPENR_GPIOELPEN_Msk
#define RCC_AHB4LPENR_GPIOFLPEN_Pos    (5U)
#define RCC_AHB4LPENR_GPIOFLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOFLPEN_Pos)  /*!< 0x00000020 */
#define RCC_AHB4LPENR_GPIOFLPEN        RCC_AHB4LPENR_GPIOFLPEN_Msk
#define RCC_AHB4LPENR_GPIOGLPEN_Pos    (6U)
#define RCC_AHB4LPENR_GPIOGLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOGLPEN_Pos)  /*!< 0x00000040 */
#define RCC_AHB4LPENR_GPIOGLPEN        RCC_AHB4LPENR_GPIOGLPEN_Msk
#define RCC_AHB4LPENR_GPIOHLPEN_Pos    (7U)
#define RCC_AHB4LPENR_GPIOHLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOHLPEN_Pos)  /*!< 0x00000080 */
#define RCC_AHB4LPENR_GPIOHLPEN        RCC_AHB4LPENR_GPIOHLPEN_Msk
#define RCC_AHB4LPENR_GPIOMLPEN_Pos    (12U)
#define RCC_AHB4LPENR_GPIOMLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOMLPEN_Pos)  /*!< 0x00001000 */
#define RCC_AHB4LPENR_GPIOMLPEN        RCC_AHB4LPENR_GPIOMLPEN_Msk
#define RCC_AHB4LPENR_GPIONLPEN_Pos    (13U)
#define RCC_AHB4LPENR_GPIONLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIONLPEN_Pos)  /*!< 0x00002000 */
#define RCC_AHB4LPENR_GPIONLPEN        RCC_AHB4LPENR_GPIONLPEN_Msk
#define RCC_AHB4LPENR_GPIOOLPEN_Pos    (14U)
#define RCC_AHB4LPENR_GPIOOLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOOLPEN_Pos)  /*!< 0x00004000 */
#define RCC_AHB4LPENR_GPIOOLPEN        RCC_AHB4LPENR_GPIOOLPEN_Msk
#define RCC_AHB4LPENR_GPIOPLPEN_Pos    (15U)
#define RCC_AHB4LPENR_GPIOPLPEN_Msk    (0x1UL << RCC_AHB4LPENR_GPIOPLPEN_Pos)  /*!< 0x00008000 */
#define RCC_AHB4LPENR_GPIOPLPEN        RCC_AHB4LPENR_GPIOPLPEN_Msk
#define RCC_AHB4LPENR_CRCLPEN_Pos      (19U)
#define RCC_AHB4LPENR_CRCLPEN_Msk      (0x1UL << RCC_AHB4LPENR_CRCLPEN_Pos)    /*!< 0x00080000 */
#define RCC_AHB4LPENR_CRCLPEN          RCC_AHB4LPENR_CRCLPEN_Msk
#define RCC_AHB4LPENR_BKPRAMLPEN_Pos   (28U)
#define RCC_AHB4LPENR_BKPRAMLPEN_Msk   (0x1UL << RCC_AHB4LPENR_BKPRAMLPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB4LPENR_BKPRAMLPEN       RCC_AHB4LPENR_BKPRAMLPEN_Msk

/********************  Bit definition for RCC_AHB5LPENR register  *************/
#define RCC_AHB5LPENR_HPDMA1LPEN_Pos   (0U)
#define RCC_AHB5LPENR_HPDMA1LPEN_Msk   (0x1UL << RCC_AHB5LPENR_HPDMA1LPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB5LPENR_HPDMA1LPEN       RCC_AHB5LPENR_HPDMA1LPEN_Msk
#define RCC_AHB5LPENR_DMA2DLPEN_Pos    (1U)
#define RCC_AHB5LPENR_DMA2DLPEN_Msk    (0x1UL << RCC_AHB5LPENR_DMA2DLPEN_Pos)  /*!< 0x00000002 */
#define RCC_AHB5LPENR_DMA2DLPEN        RCC_AHB5LPENR_DMA2DLPEN_Msk
#define RCC_AHB5LPENR_FLASHLPEN_Pos    (2U)
#define RCC_AHB5LPENR_FLASHLPEN_Msk    (0x1UL << RCC_AHB5LPENR_FLASHLPEN_Pos)  /*!< 0x00000004 */
#define RCC_AHB5LPENR_FLASHLPEN        RCC_AHB5LPENR_FLASHLPEN_Msk
#define RCC_AHB5LPENR_JPEGLPEN_Pos     (3U)
#define RCC_AHB5LPENR_JPEGLPEN_Msk     (0x1UL << RCC_AHB5LPENR_JPEGLPEN_Pos)   /*!< 0x00000008 */
#define RCC_AHB5LPENR_JPEGLPEN         RCC_AHB5LPENR_JPEGLPEN_Msk
#define RCC_AHB5LPENR_FMCLPEN_Pos      (4U)
#define RCC_AHB5LPENR_FMCLPEN_Msk      (0x1UL << RCC_AHB5LPENR_FMCLPEN_Pos)    /*!< 0x00000010 */
#define RCC_AHB5LPENR_FMCLPEN          RCC_AHB5LPENR_FMCLPEN_Msk
#define RCC_AHB5LPENR_XSPI1LPEN_Pos    (5U)
#define RCC_AHB5LPENR_XSPI1LPEN_Msk    (0x1UL << RCC_AHB5LPENR_XSPI1LPEN_Pos)  /*!< 0x00000020 */
#define RCC_AHB5LPENR_XSPI1LPEN        RCC_AHB5LPENR_XSPI1LPEN_Msk
#define RCC_AHB5LPENR_SDMMC1LPEN_Pos   (8U)
#define RCC_AHB5LPENR_SDMMC1LPEN_Msk   (0x1UL << RCC_AHB5LPENR_SDMMC1LPEN_Pos) /*!< 0x00000100 */
#define RCC_AHB5LPENR_SDMMC1LPEN       RCC_AHB5LPENR_SDMMC1LPEN_Msk
#define RCC_AHB5LPENR_XSPI2LPEN_Pos    (12U)
#define RCC_AHB5LPENR_XSPI2LPEN_Msk    (0x1UL << RCC_AHB5LPENR_XSPI2LPEN_Pos)  /*!< 0x00001000 */
#define RCC_AHB5LPENR_XSPI2LPEN        RCC_AHB5LPENR_XSPI2LPEN_Msk
#define RCC_AHB5LPENR_XSPIMLPEN_Pos    (14U)
#define RCC_AHB5LPENR_XSPIMLPEN_Msk    (0x1UL << RCC_AHB5LPENR_XSPIMLPEN_Pos)  /*!< 0x00004000 */
#define RCC_AHB5LPENR_XSPIMLPEN        RCC_AHB5LPENR_XSPIMLPEN_Msk
#define RCC_AHB5LPENR_GFXMMULPEN_Pos   (19U)
#define RCC_AHB5LPENR_GFXMMULPEN_Msk   (0x1UL << RCC_AHB5LPENR_GFXMMULPEN_Pos) /*!< 0x00080000 */
#define RCC_AHB5LPENR_GFXMMULPEN       RCC_AHB5LPENR_GFXMMULPEN_Msk
#define RCC_AHB5LPENR_DTCM1LPEN_Pos    (28U)
#define RCC_AHB5LPENR_DTCM1LPEN_Msk    (0x1UL << RCC_AHB5LPENR_DTCM1LPEN_Pos)  /*!< 0x10000000 */
#define RCC_AHB5LPENR_DTCM1LPEN        RCC_AHB5LPENR_DTCM1LPEN_Msk
#define RCC_AHB5LPENR_DTCM2LPEN_Pos    (29U)
#define RCC_AHB5LPENR_DTCM2LPEN_Msk    (0x1UL << RCC_AHB5LPENR_DTCM2LPEN_Pos)  /*!< 0x20000000 */
#define RCC_AHB5LPENR_DTCM2LPEN        RCC_AHB5LPENR_DTCM2LPEN_Msk
#define RCC_AHB5LPENR_ITCMLPEN_Pos     (30U)
#define RCC_AHB5LPENR_ITCMLPEN_Msk     (0x1UL << RCC_AHB5LPENR_ITCMLPEN_Pos)   /*!< 0x40000000 */
#define RCC_AHB5LPENR_ITCMLPEN         RCC_AHB5LPENR_ITCMLPEN_Msk
#define RCC_AHB5LPENR_AXISRAMLPEN_Pos  (31U)
#define RCC_AHB5LPENR_AXISRAMLPEN_Msk  (0x1UL << RCC_AHB5LPENR_AXISRAMLPEN_Pos) /*!< 0x80000000 */
#define RCC_AHB5LPENR_AXISRAMLPEN      RCC_AHB5LPENR_AXISRAMLPEN_Msk

/********************  Bit definition for RCC_APB1LPENR1 register  ************/
#define RCC_APB1LPENR1_TIM2LPEN_Pos    (0U)
#define RCC_APB1LPENR1_TIM2LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM2LPEN_Pos)  /*!< 0x00000001 */
#define RCC_APB1LPENR1_TIM2LPEN        RCC_APB1LPENR1_TIM2LPEN_Msk
#define RCC_APB1LPENR1_TIM3LPEN_Pos    (1U)
#define RCC_APB1LPENR1_TIM3LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM3LPEN_Pos)  /*!< 0x00000002 */
#define RCC_APB1LPENR1_TIM3LPEN        RCC_APB1LPENR1_TIM3LPEN_Msk
#define RCC_APB1LPENR1_TIM4LPEN_Pos    (2U)
#define RCC_APB1LPENR1_TIM4LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM4LPEN_Pos)  /*!< 0x00000004 */
#define RCC_APB1LPENR1_TIM4LPEN        RCC_APB1LPENR1_TIM4LPEN_Msk
#define RCC_APB1LPENR1_TIM5LPEN_Pos    (3U)
#define RCC_APB1LPENR1_TIM5LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM5LPEN_Pos)  /*!< 0x00000008 */
#define RCC_APB1LPENR1_TIM5LPEN        RCC_APB1LPENR1_TIM5LPEN_Msk
#define RCC_APB1LPENR1_TIM6LPEN_Pos    (4U)
#define RCC_APB1LPENR1_TIM6LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM6LPEN_Pos)  /*!< 0x00000010 */
#define RCC_APB1LPENR1_TIM6LPEN        RCC_APB1LPENR1_TIM6LPEN_Msk
#define RCC_APB1LPENR1_TIM7LPEN_Pos    (5U)
#define RCC_APB1LPENR1_TIM7LPEN_Msk    (0x1UL << RCC_APB1LPENR1_TIM7LPEN_Pos)  /*!< 0x00000020 */
#define RCC_APB1LPENR1_TIM7LPEN        RCC_APB1LPENR1_TIM7LPEN_Msk
#define RCC_APB1LPENR1_TIM12LPEN_Pos   (6U)
#define RCC_APB1LPENR1_TIM12LPEN_Msk   (0x1UL << RCC_APB1LPENR1_TIM12LPEN_Pos) /*!< 0x00000040 */
#define RCC_APB1LPENR1_TIM12LPEN       RCC_APB1LPENR1_TIM12LPEN_Msk
#define RCC_APB1LPENR1_TIM13LPEN_Pos   (7U)
#define RCC_APB1LPENR1_TIM13LPEN_Msk   (0x1UL << RCC_APB1LPENR1_TIM13LPEN_Pos) /*!< 0x00000080 */
#define RCC_APB1LPENR1_TIM13LPEN       RCC_APB1LPENR1_TIM13LPEN_Msk
#define RCC_APB1LPENR1_TIM14LPEN_Pos   (8U)
#define RCC_APB1LPENR1_TIM14LPEN_Msk   (0x1UL << RCC_APB1LPENR1_TIM14LPEN_Pos) /*!< 0x00000100 */
#define RCC_APB1LPENR1_TIM14LPEN       RCC_APB1LPENR1_TIM14LPEN_Msk
#define RCC_APB1LPENR1_LPTIM1LPEN_Pos  (9U)
#define RCC_APB1LPENR1_LPTIM1LPEN_Msk  (0x1UL << RCC_APB1LPENR1_LPTIM1LPEN_Pos)/*!< 0x00000200 */
#define RCC_APB1LPENR1_LPTIM1LPEN      RCC_APB1LPENR1_LPTIM1LPEN_Msk
#define RCC_APB1LPENR1_WWDGLPEN_Pos    (11U)
#define RCC_APB1LPENR1_WWDGLPEN_Msk    (0x1UL << RCC_APB1LPENR1_WWDGLPEN_Pos)  /*!< 0x00000800 */
#define RCC_APB1LPENR1_WWDGLPEN        RCC_APB1LPENR1_WWDGLPEN_Msk
#define RCC_APB1LPENR1_SPI2LPEN_Pos    (14U)
#define RCC_APB1LPENR1_SPI2LPEN_Msk    (0x1UL << RCC_APB1LPENR1_SPI2LPEN_Pos)  /*!< 0x00004000 */
#define RCC_APB1LPENR1_SPI2LPEN        RCC_APB1LPENR1_SPI2LPEN_Msk
#define RCC_APB1LPENR1_SPI3LPEN_Pos    (15U)
#define RCC_APB1LPENR1_SPI3LPEN_Msk    (0x1UL << RCC_APB1LPENR1_SPI3LPEN_Pos)  /*!< 0x00008000 */
#define RCC_APB1LPENR1_SPI3LPEN        RCC_APB1LPENR1_SPI3LPEN_Msk
#define RCC_APB1LPENR1_SPDIFRXLPEN_Pos (16U)
#define RCC_APB1LPENR1_SPDIFRXLPEN_Msk (0x1UL << RCC_APB1LPENR1_SPDIFRXLPEN_Pos)/*!< 0x00010000 */
#define RCC_APB1LPENR1_SPDIFRXLPEN     RCC_APB1LPENR1_SPDIFRXLPEN_Msk
#define RCC_APB1LPENR1_USART2LPEN_Pos  (17U)
#define RCC_APB1LPENR1_USART2LPEN_Msk  (0x1UL << RCC_APB1LPENR1_USART2LPEN_Pos)/*!< 0x00020000 */
#define RCC_APB1LPENR1_USART2LPEN      RCC_APB1LPENR1_USART2LPEN_Msk
#define RCC_APB1LPENR1_USART3LPEN_Pos  (18U)
#define RCC_APB1LPENR1_USART3LPEN_Msk  (0x1UL << RCC_APB1LPENR1_USART3LPEN_Pos)/*!< 0x00040000 */
#define RCC_APB1LPENR1_USART3LPEN      RCC_APB1LPENR1_USART3LPEN_Msk
#define RCC_APB1LPENR1_UART4LPEN_Pos   (19U)
#define RCC_APB1LPENR1_UART4LPEN_Msk   (0x1UL << RCC_APB1LPENR1_UART4LPEN_Pos) /*!< 0x00080000 */
#define RCC_APB1LPENR1_UART4LPEN       RCC_APB1LPENR1_UART4LPEN_Msk
#define RCC_APB1LPENR1_UART5LPEN_Pos   (20U)
#define RCC_APB1LPENR1_UART5LPEN_Msk   (0x1UL << RCC_APB1LPENR1_UART5LPEN_Pos) /*!< 0x00100000 */
#define RCC_APB1LPENR1_UART5LPEN       RCC_APB1LPENR1_UART5LPEN_Msk
#define RCC_APB1LPENR1_I2C1_I3C1LPEN_Pos (21U)
#define RCC_APB1LPENR1_I2C1_I3C1LPEN_Msk (0x1UL << RCC_APB1LPENR1_I2C1_I3C1LPEN_Pos)  /*!< 0x00200000 */
#define RCC_APB1LPENR1_I2C1_I3C1LPEN   RCC_APB1LPENR1_I2C1_I3C1LPEN_Msk
#define RCC_APB1LPENR1_I2C2LPEN_Pos    (22U)
#define RCC_APB1LPENR1_I2C2LPEN_Msk    (0x1UL << RCC_APB1LPENR1_I2C2LPEN_Pos)  /*!< 0x00400000 */
#define RCC_APB1LPENR1_I2C2LPEN        RCC_APB1LPENR1_I2C2LPEN_Msk
#define RCC_APB1LPENR1_I2C3LPEN_Pos    (23U)
#define RCC_APB1LPENR1_I2C3LPEN_Msk    (0x1UL << RCC_APB1LPENR1_I2C3LPEN_Pos)  /*!< 0x00800000 */
#define RCC_APB1LPENR1_I2C3LPEN        RCC_APB1LPENR1_I2C3LPEN_Msk
#define RCC_APB1LPENR1_CECLPEN_Pos     (27U)
#define RCC_APB1LPENR1_CECLPEN_Msk     (0x1UL << RCC_APB1LPENR1_CECLPEN_Pos)   /*!< 0x08000000 */
#define RCC_APB1LPENR1_CECLPEN         RCC_APB1LPENR1_CECLPEN_Msk
#define RCC_APB1LPENR1_UART7LPEN_Pos   (30U)
#define RCC_APB1LPENR1_UART7LPEN_Msk   (0x1UL << RCC_APB1LPENR1_UART7LPEN_Pos) /*!< 0x40000000 */
#define RCC_APB1LPENR1_UART7LPEN       RCC_APB1LPENR1_UART7LPEN_Msk
#define RCC_APB1LPENR1_UART8LPEN_Pos   (31U)
#define RCC_APB1LPENR1_UART8LPEN_Msk   (0x1UL << RCC_APB1LPENR1_UART8LPEN_Pos) /*!< 0x80000000 */
#define RCC_APB1LPENR1_UART8LPEN       RCC_APB1LPENR1_UART8LPEN_Msk

/********************  Bit definition for RCC_PB1LPENR2 register  ************/
#define RCC_APB1LPENR2_CRSLPEN_Pos     (1U)
#define RCC_APB1LPENR2_CRSLPEN_Msk     (0x1UL << RCC_APB1LPENR2_CRSLPEN_Pos)   /*!< 0x00000002 */
#define RCC_APB1LPENR2_CRSLPEN         RCC_APB1LPENR2_CRSLPEN_Msk
#define RCC_APB1LPENR2_MDIOSLPEN_Pos   (5U)
#define RCC_APB1LPENR2_MDIOSLPEN_Msk   (0x1UL << RCC_APB1LPENR2_MDIOSLPEN_Pos) /*!< 0x00000020 */
#define RCC_APB1LPENR2_MDIOSLPEN       RCC_APB1LPENR2_MDIOSLPEN_Msk
#define RCC_APB1LPENR2_FDCANLPEN_Pos   (8U)
#define RCC_APB1LPENR2_FDCANLPEN_Msk   (0x1UL << RCC_APB1LPENR2_FDCANLPEN_Pos) /*!< 0x00000100 */
#define RCC_APB1LPENR2_FDCANLPEN       RCC_APB1LPENR2_FDCANLPEN_Msk
#define RCC_APB1LPENR2_UCPD1LPEN_Pos   (27U)
#define RCC_APB1LPENR2_UCPD1LPEN_Msk   (0x1UL << RCC_APB1LPENR2_UCPD1LPEN_Pos) /*!< 0x08000000 */
#define RCC_APB1LPENR2_UCPD1LPEN       RCC_APB1LPENR2_UCPD1LPEN_Msk

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define RCC_APB2LPENR_TIM1LPEN_Pos     (0U)
#define RCC_APB2LPENR_TIM1LPEN_Msk     (0x1UL << RCC_APB2LPENR_TIM1LPEN_Pos)   /*!< 0x00000001 */
#define RCC_APB2LPENR_TIM1LPEN         RCC_APB2LPENR_TIM1LPEN_Msk
#define RCC_APB2LPENR_USART1LPEN_Pos   (4U)
#define RCC_APB2LPENR_USART1LPEN_Msk   (0x1UL << RCC_APB2LPENR_USART1LPEN_Pos) /*!< 0x00000010 */
#define RCC_APB2LPENR_USART1LPEN       RCC_APB2LPENR_USART1LPEN_Msk
#define RCC_APB2LPENR_SPI1LPEN_Pos     (12U)
#define RCC_APB2LPENR_SPI1LPEN_Msk     (0x1UL << RCC_APB2LPENR_SPI1LPEN_Pos)   /*!< 0x00001000 */
#define RCC_APB2LPENR_SPI1LPEN         RCC_APB2LPENR_SPI1LPEN_Msk
#define RCC_APB2LPENR_SPI4LPEN_Pos     (13U)
#define RCC_APB2LPENR_SPI4LPEN_Msk     (0x1UL << RCC_APB2LPENR_SPI4LPEN_Pos)   /*!< 0x00002000 */
#define RCC_APB2LPENR_SPI4LPEN         RCC_APB2LPENR_SPI4LPEN_Msk
#define RCC_APB2LPENR_TIM15LPEN_Pos    (16U)
#define RCC_APB2LPENR_TIM15LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM15LPEN_Pos)  /*!< 0x00010000 */
#define RCC_APB2LPENR_TIM15LPEN        RCC_APB2LPENR_TIM15LPEN_Msk
#define RCC_APB2LPENR_TIM16LPEN_Pos    (17U)
#define RCC_APB2LPENR_TIM16LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM16LPEN_Pos)  /*!< 0x00020000 */
#define RCC_APB2LPENR_TIM16LPEN        RCC_APB2LPENR_TIM16LPEN_Msk
#define RCC_APB2LPENR_TIM17LPEN_Pos    (18U)
#define RCC_APB2LPENR_TIM17LPEN_Msk    (0x1UL << RCC_APB2LPENR_TIM17LPEN_Pos)  /*!< 0x00040000 */
#define RCC_APB2LPENR_TIM17LPEN        RCC_APB2LPENR_TIM17LPEN_Msk
#define RCC_APB2LPENR_TIM9LPEN_Pos     (19U)
#define RCC_APB2LPENR_TIM9LPEN_Msk     (0x1UL << RCC_APB2LPENR_TIM9LPEN_Pos)   /*!< 0x00080000 */
#define RCC_APB2LPENR_TIM9LPEN         RCC_APB2LPENR_TIM9LPEN_Msk
#define RCC_APB2LPENR_SPI5LPEN_Pos     (20U)
#define RCC_APB2LPENR_SPI5LPEN_Msk     (0x1UL << RCC_APB2LPENR_SPI5LPEN_Pos)   /*!< 0x00100000 */
#define RCC_APB2LPENR_SPI5LPEN         RCC_APB2LPENR_SPI5LPEN_Msk
#define RCC_APB2LPENR_SAI1LPEN_Pos     (22U)
#define RCC_APB2LPENR_SAI1LPEN_Msk     (0x1UL << RCC_APB2LPENR_SAI1LPEN_Pos)   /*!< 0x00400000 */
#define RCC_APB2LPENR_SAI1LPEN         RCC_APB2LPENR_SAI1LPEN_Msk
#define RCC_APB2LPENR_SAI2LPEN_Pos     (23U)
#define RCC_APB2LPENR_SAI2LPEN_Msk     (0x1UL << RCC_APB2LPENR_SAI2LPEN_Pos)   /*!< 0x00800000 */
#define RCC_APB2LPENR_SAI2LPEN         RCC_APB2LPENR_SAI2LPEN_Msk

/********************  Bit definition for RCC_APB4LPENR register  *************/
#define RCC_APB4LPENR_SBSLPEN_Pos      (1U)
#define RCC_APB4LPENR_SBSLPEN_Msk      (0x1UL << RCC_APB4LPENR_SBSLPEN_Pos)    /*!< 0x00000002 */
#define RCC_APB4LPENR_SBSLPEN          RCC_APB4LPENR_SBSLPEN_Msk
#define RCC_APB4LPENR_LPUART1LPEN_Pos  (3U)
#define RCC_APB4LPENR_LPUART1LPEN_Msk  (0x1UL << RCC_APB4LPENR_LPUART1LPEN_Pos)/*!< 0x00000008 */
#define RCC_APB4LPENR_LPUART1LPEN      RCC_APB4LPENR_LPUART1LPEN_Msk
#define RCC_APB4LPENR_SPI6LPEN_Pos     (5U)
#define RCC_APB4LPENR_SPI6LPEN_Msk     (0x1UL << RCC_APB4LPENR_SPI6LPEN_Pos)   /*!< 0x00000020 */
#define RCC_APB4LPENR_SPI6LPEN         RCC_APB4LPENR_SPI6LPEN_Msk
#define RCC_APB4LPENR_LPTIM2LPEN_Pos   (9U)
#define RCC_APB4LPENR_LPTIM2LPEN_Msk   (0x1UL << RCC_APB4LPENR_LPTIM2LPEN_Pos) /*!< 0x00000200 */
#define RCC_APB4LPENR_LPTIM2LPEN       RCC_APB4LPENR_LPTIM2LPEN_Msk
#define RCC_APB4LPENR_LPTIM3LPEN_Pos   (10U)
#define RCC_APB4LPENR_LPTIM3LPEN_Msk   (0x1UL << RCC_APB4LPENR_LPTIM3LPEN_Pos) /*!< 0x00000400 */
#define RCC_APB4LPENR_LPTIM3LPEN       RCC_APB4LPENR_LPTIM3LPEN_Msk
#define RCC_APB4LPENR_LPTIM4LPEN_Pos   (11U)
#define RCC_APB4LPENR_LPTIM4LPEN_Msk   (0x1UL << RCC_APB4LPENR_LPTIM4LPEN_Pos) /*!< 0x00000800 */
#define RCC_APB4LPENR_LPTIM4LPEN       RCC_APB4LPENR_LPTIM4LPEN_Msk
#define RCC_APB4LPENR_LPTIM5LPEN_Pos   (12U)
#define RCC_APB4LPENR_LPTIM5LPEN_Msk   (0x1UL << RCC_APB4LPENR_LPTIM5LPEN_Pos) /*!< 0x00001000 */
#define RCC_APB4LPENR_LPTIM5LPEN       RCC_APB4LPENR_LPTIM5LPEN_Msk
#define RCC_APB4LPENR_VREFLPEN_Pos     (15U)
#define RCC_APB4LPENR_VREFLPEN_Msk     (0x1UL << RCC_APB4LPENR_VREFLPEN_Pos)   /*!< 0x00008000 */
#define RCC_APB4LPENR_VREFLPEN         RCC_APB4LPENR_VREFLPEN_Msk
#define RCC_APB4LPENR_RTCAPBLPEN_Pos   (16U)
#define RCC_APB4LPENR_RTCAPBLPEN_Msk   (0x1UL << RCC_APB4LPENR_RTCAPBLPEN_Pos) /*!< 0x00010000 */
#define RCC_APB4LPENR_RTCAPBLPEN       RCC_APB4LPENR_RTCAPBLPEN_Msk
#define RCC_APB4LPENR_DTSLPEN_Pos      (26U)
#define RCC_APB4LPENR_DTSLPEN_Msk      (0x1UL << RCC_APB4LPENR_DTSLPEN_Pos)    /*!< 0x04000000 */
#define RCC_APB4LPENR_DTSLPEN          RCC_APB4LPENR_DTSLPEN_Msk

